pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
    frameCnt = (ksz8851_regrd(REG_RX_FRAME_CNT_THRES) & RX_FRAME_CNT_MASK) >> 8;
    uint32_t frameCntLog = frameCnt;
    // MSG("TE process_rx f:%u\n", frameCnt);
    while (frameCnt > 0)
    {
        ksz8851RetrievePacketData(modeth_rxBuff, &len);
        if(len)
        {
            totalLen += len;
            tcpip_adapter_eth_input(modeth_rxBuff, len, NULL);
        }
        frameCnt--;
    }
    MSG("TE process_rx frameCnt:%u len:%u\n", frameCntLog, totalLen);
    return totalLen;
}

static void processInterrupt(void) {
    modeth_cmd_ctx_t ctx;
    ctx.buf = NULL;
    ctx.isr = 0;
    uint16_t processed = 0;

    // // disable interrupts
    // // FIXME: should we disable int around reading/clearing? do we need a mutex?
    // ksz8851_regwr(REG_INT_MASK, 0);

    // read interrupt status
    ctx.isr = ksz8851_regrd(REG_INT_STATUS);

    // clear interrupt status
    ksz8851_regwr(REG_INT_STATUS, 0xFFFF);

    // // enable interrupts
    // ksz8851_regwr(REG_INT_MASK, INT_MASK);

    // MSG("processInterrupt 0x%x\n", ctx.isr);

    // FIXME: capture errQUEUE_FULL

    if (ctx.isr & INT_RX) {
        //set RXIE event
        ctx.cmd = ETH_CMD_RX;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_RX_OVERRUN) {
        //set overrun event
        ctx.cmd = ETH_CMD_OVERRUN;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_PHY) {
        //set LCIE event
        ctx.cmd = ETH_CMD_CHK_LINK;
        // TODO: nofify needed?
        // // unblock task if link up
        // if(!eth_obj.link_status)
        // {
        //     xTaskNotifyFromISR(ethernetTaskHandle, 0, eIncrement, NULL);
        // }
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (processed != 1){
        MSG("processInterrupt 0x%x %u\n", ctx.isr, processed);
    }

    // if ( ! processed ) {
    //     // Normally this shouldn't happen. It migth be possible to happen in this case:
    //     // interupt fires
    //     // cmd is put is received via the queue
    //     // another interupt fires and puts a new cmd into the queue
    //     // processInterrupt for the first one is exectued, but handles both (all) events
    //     // later the second cmd is handled but processInterrupt doesn't find anything to do
    //     // this case shouldn't be a real problem though?!
    //     ctx.cmd = ETH_CMD_OTHER;
    //     xQueueSend(eth_cmdQueue, &ctx, portMAX_DELAY);
    //     processed++;
    // }

}


/* callback runs from interrupt context */
static IRAM_ATTR void ksz8851_evt_callback(uint32_t ksz8851_evt)
{
    modeth_cmd_ctx_t ctx;
    ctx.cmd = ETH_CMD_HW_INT;
    ctx.buf = NULL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendToFrontFromISR(eth_cmdQueue, &ctx, &xHigherPriorityTaskWoken);
    // seems is needed for link up at the start ... TODO is it actually the best solution to ulTaskNotifyTake() from Task_ETHERNET to wait for link up?
    // xTaskNotifyFromISR(ethernetTaskHandle, 0, eIncrement, NULL);
}

// void printTaskStatus(){
//     UBaseType_t numTasks = uxTaskGetNumberOfTasks();
//     char* taskStatusWriteBuffer = (char*) heap_caps_malloc(sizeof(char) * 40 * numTasks, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
//     vTaskGetRunTimeStats(taskStatusWriteBuffer);
//     MSG("TE vTaskGetRunTimeStats:\n%s\n", taskStatusWriteBuffer);
//     heap_caps_free(taskStatusWriteBuffer);
// }

static void TASK_ETHERNET (void *pvParameters) {
    MSG("TE\n");

    static uint32_t thread_notification;
    system_event_t evt;
    modeth_cmd_ctx_t queue_entry;
    uint16_t timeout = 0;
    uint16_t max_timeout = 50u; // 5

    // Block task till notification is recieved
    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    MSG("TE tn=%u\n", thread_notification);

    if (thread_notification)
    {
        if(ESP_OK != esp_read_mac(ethernet_mac, ESP_MAC_ETH))
        {
            // Set mac to default
            ethernet_mac[0] = KSZ8851_MAC0;
            ethernet_mac[1] = KSZ8851_MAC1;
            ethernet_mac[2] = KSZ8851_MAC2;
            ethernet_mac[3] = KSZ8851_MAC3;
            ethernet_mac[4] = KSZ8851_MAC4;
            ethernet_mac[5] = KSZ8851_MAC5;
        }
        else
        {
            // check for MAC address limitation of KSZ8851 (5th Byte should not be 0x06)
            if(ethernet_mac[4] == 0x06)
            {
                // OR this byte with last byte
                ethernet_mac[4] |= (ethernet_mac[5] | 0x01 /*Just in case if last byte = 0*/ );
            }
        }
        //save mac
        memcpy(eth_obj.mac, ethernet_mac, ETH_MAC_SIZE);

        //Init spi
        ksz8851SpiInit();
        /* link status  */
        ksz8851RegisterEvtCb(ksz8851_evt_callback);
eth_start:
        MSG("TE eth_start\n");
        xQueueReset(eth_cmdQueue);
        xEventGroupWaitBits(eth_event_group, ETHERNET_EVT_STARTED, false, true, portMAX_DELAY);
        MSG("TE init driver\n");
        // Init Driver
        ksz8851Init();

        evt.event_id = SYSTEM_EVENT_ETH_START;
        esp_event_send(&evt);

        MSG("TE ls=%u 10M=%u 100M=%u\n", get_eth_link_speed(), ETH_SPEED_MODE_10M, ETH_SPEED_MODE_100M);
        UBaseType_t stack_high = uxTaskGetStackHighWaterMark(NULL);
        // MSG("TE stack_high=%u\n", stack_high);

        uint32_t ct = 0;
        uint32_t ctTX = 0;
        uint32_t ctRX = 0;
        uint32_t totalTX = 0;
        uint32_t totalRX = 0;
        bool printStat = false;
        uint16_t interrupt_pin_value = pin_get_value(KSZ8851_INT_PIN);
        uint16_t interrupt_stati = 0;
        for(;;)
        {
            UBaseType_t stack_high_new = uxTaskGetStackHighWaterMark(NULL);
            uint16_t interrupt_pin_value_new = pin_get_value(KSZ8851_INT_PIN);
            //uint16_t interrupt_value_new = ksz8851_regrd(REG_INT_STATUS);
            uint16_t interrupt_stati_new = 0;
            interrupt_stati_new = ksz8851_regrd(REG_INT_STATUS);
            if ( interrupt_stati_new != interrupt_stati ) {
                if (interrupt_stati_new)
                    printStat = true;
                interrupt_stati = interrupt_stati_new;
            }
            if (stack_high_new > stack_high) {
                stack_high = stack_high_new;
                printStat = true;
            }
            if (interrupt_pin_value_new != interrupt_pin_value ) {
                interrupt_pin_value = interrupt_pin_value_new;
                printStat = true;
            }
            if (ct % 100 == 0){
                printStat = true;
            }
            if (printStat){
                MSG("TE ct=%u stack:%u queue:%u tx:%u/%u rx:%u/%u:%f link:%u int:0x%x isr:0x%x (%u/%u) rstovf=%u rstint=%u\n",
                // port:0x%x speed:%u\n",
                    ct, stack_high, uxQueueMessagesWaiting( eth_cmdQueue ),
                    ctTX, totalTX, ctRX, totalRX, ((double)totalRX/ctRX),
                    ksz8851GetLinkStatus(), interrupt_pin_value, interrupt_stati, num_strange_isr, num_strange_isr_zero,
                    num_resets_overflow, num_resets_int_pin);
                    // ksz8851_regrd(REG_PORT_STATUS), get_eth_link_speed() );
                // if (ct % 1000 == 0)
                //     printTaskStatus();

                    // spi_op
                    // ksz8851GetLinkStatus
                    // ksz8851PowerDownMode
                    // pi_setbits(REG_PORT_LINK_MD, PORT_POWER_SAVE_MODE);
                    // ksz8851BeginPacketSend

                printStat = false;

                // UBaseType_t numTasks = uxTaskGetNumberOfTasks();

                // TaskStatus_t* taskStatus = (TaskStatus_t*) heap_caps_malloc(sizeof(TaskStatus_t) * numTasks, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
                // UBaseType_t totalRuntime = 0;
                // UBaseType_t numTasksGotten = uxTaskGetSystemState(taskStatus, numTasks, &totalRuntime);
                // MSG("TE uxTaskGetSystemState: %u, %u, %u\n", numTasks, numTasksGotten, totalRuntime);
                // heap_caps_free(taskStatus);

