pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
            }


            ct++;

            // if(!eth_obj.link_status && (xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED))
            // {
            //     // block till link is up again
            //     MSG("TE link not up\n");
            //     ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
            // }

            // MSG("TE x\n");
            if(!(xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED))
            {
                MSG("TE not started\n");
                // deinit called, free memory and block till re-init
                xQueueReset(eth_cmdQueue);
                heap_caps_free(modeth_rxBuff);
                eth_obj.link_status = false;
                evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                esp_event_send(&evt);
                //Disable  interrupts
                ksz8851_regwr(REG_INT_MASK, 0x0000);
                MSG("TE goto eth_start\n");
                goto eth_start;
            }

            if (xQueueReceive(eth_cmdQueue, &queue_entry, 200 / portTICK_PERIOD_MS) == pdTRUE)
            {

                bool log = true;
                // if (queue_entry.cmd == ETH_CMD_TX){
                //     // don't log tx
                //     log = false;
                // }
                // if (queue_entry.cmd == ETH_CMD_RX && interrupt_pin_value ){
                //     // don't log rx as long as the int pin is ok (high)
                //     log = false;
                // }

                if (log)
                    MSG("TE ct=%u cmd:0x%x isr:0x%x queue:%u ksz8851:%u 0x%x port:0x%x speed:%u\n",
                        ct, queue_entry.cmd, (queue_entry.cmd == ETH_CMD_TX)?0:queue_entry.isr, uxQueueMessagesWaiting( eth_cmdQueue ),
                        ksz8851GetLinkStatus(), interrupt_pin_value, ksz8851_regrd(REG_PORT_STATUS), get_eth_link_speed() );

                switch(queue_entry.cmd)
                {
                    case ETH_CMD_TX:
                        //MSG("TE TX %u\n", queue_entry.len);
                        ctTX++;
                        totalTX += queue_entry.len;
                        process_tx(queue_entry.buf, queue_entry.len);
                        break;
                    case ETH_CMD_HW_INT:
                        processInterrupt();
                        break;
                    case ETH_CMD_RX:
                        //MSG("TE RX {0x%x}\n", queue_entry.isr);
                        ctRX++;
                        totalRX += process_rx();
                        // // Clear Intr status bits
                        // // TODO: I think it's wrong to clear status here. But, we it should be properly tested
                        // ksz8851_regwr(REG_INT_STATUS, INT_MASK);
                        break;
                    case ETH_CMD_CHK_LINK:
                        MSG("TE CHK_LINK {0x%x}\n", queue_entry.isr);
                        if(ksz8851GetLinkStatus())
                        {
                            eth_obj.link_status = true;
                            evt.event_id = SYSTEM_EVENT_ETH_CONNECTED;
                            esp_event_send(&evt);
                        }
                        else
                        {
                            eth_obj.link_status = false;
                            evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                            esp_event_send(&evt);
                        }
                        // // Clear Intr status bits
                        // // TODO: I think it's wrong to clear status here. But, we it should be properly tested
                        // ksz8851_regwr(REG_INT_STATUS, INT_MASK);
                        break;
                    case ETH_CMD_OVERRUN:
                        MSG("TE OVERRUN {0x%x} ========================================\n", queue_entry.isr);
                        xQueueReset(eth_cmdQueue);
                        eth_obj.link_status = false;
                        ksz8851PowerDownMode();
                        evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                        esp_event_send(&evt);
                        vTaskDelay(100 / portTICK_PERIOD_MS);
                        ksz8851Init();
                        break;
                    default:
                        //MSG("TE def cmd:0x%x isr:0x%x\n", queue_entry.cmd, queue_entry.isr);
                        num_strange_isr++;
                        if (queue_entry.isr == 0)
                            num_strange_isr_zero++;
                        break;
                }
            }
            else
            {
                timeout = 0;
                // Checking if interrupt line is locked up in Low state
                //TODO: This workaround should be removed once the lockup is resolved
                while((!pin_get_value(KSZ8851_INT_PIN)) && timeout < max_timeout)
                {
                    MSG("TE TO %u\n", timeout);

                    vTaskDelay(10 / portTICK_PERIOD_MS);
                    timeout++;
                }
                if(timeout >= max_timeout)
                {
                    MSG("TE Force Int\n");
                    num_resets_int_pin++;
                    xQueueReset(eth_cmdQueue);
                    eth_obj.link_status = false;
                    ksz8851PowerDownMode();
                    evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                    esp_event_send(&evt);
                    vTaskDelay(100 / portTICK_PERIOD_MS);
                    // TODO: should we ksz8851SpiInit() here?
                    ksz8851Init();

                    // // workaround for the workaround. Even the ksz8851 chip reset above is not enough to reliable restablish eth communication, let's reset the whole chip
                    // printf("ksz8851 lockup detected ... resetting device\n");
                    // vTaskDelay(100 / portTICK_PERIOD_MS);
                    // machine_reset();
                }
            }
        }
    }
}

