pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
STATIC void eth_validate_hostname (const char *hostname) {
    //dont set hostname it if is null, so its a valid hostname
    if (hostname == NULL) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, mpexception_value_invalid_arguments));
    }

    uint8_t len = strlen(hostname);
    if(len == 0 || len > TCPIP_HOSTNAME_MAX_SIZE){
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, mpexception_value_invalid_arguments));
    }
}

/*****************************************************************************
* MICROPYTHON FUNCTIONS
*****************************************************************************/

STATIC const mp_arg_t eth_init_args[] = {
    { MP_QSTR_id,                             MP_ARG_INT,  {.u_int = 0} },
    { MP_QSTR_hostname,         MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
};
STATIC mp_obj_t eth_make_new(const mp_obj_type_t *type, mp_uint_t n_args, mp_uint_t n_kw, const mp_obj_t *all_args) {
    // parse args
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(eth_init_args)];
    mp_arg_parse_all(n_args, all_args, &kw_args, MP_ARRAY_SIZE(args), eth_init_args, args);

    // setup the object
    eth_obj_t *self = &eth_obj;
    self->base.type = (mp_obj_t)&mod_network_nic_type_eth;

    // check the peripheral id
    if (args[0].u_int != 0) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_resource_not_avaliable));
    }
    // start the peripheral
    eth_init_helper(self, &args[1]);
    return (mp_obj_t)self;
}

STATIC mp_obj_t modeth_init(mp_uint_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(eth_init_args) - 1];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(args), &eth_init_args[1], args);
    return eth_init_helper(pos_args[0], args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(modeth_init_obj, 1, modeth_init);

STATIC mp_obj_t eth_init_helper(eth_obj_t *self, const mp_arg_val_t *args) {
    MSG("ME ih\n");
    const char *hostname;

    if (!ethernetTaskHandle){
        MSG("ME ih epi\n");
        eth_pre_init();
    }

    if (args[0].u_obj != mp_const_none) {
        MSG("ME ih 0\n");
        hostname = mp_obj_str_get_str(args[0].u_obj);
        eth_validate_hostname(hostname);
        tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_ETH, hostname);
    }

    if (!(xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED)) {
        MSG("ME ih !started\n");
        //alloc memory for rx buff
        if (esp32_get_chip_rev() > 0) {
            modeth_rxBuff = heap_caps_malloc(ETHERNET_RX_PACKET_BUFF_SIZE, MALLOC_CAP_SPIRAM);
        }
        else
        {
            modeth_rxBuff = heap_caps_malloc(ETHERNET_RX_PACKET_BUFF_SIZE, MALLOC_CAP_INTERNAL);
        }

        if(modeth_rxBuff == NULL)
        {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Cant allocate memory for eth rx Buffer!"));
        }

        MSG("ME ih set(started)\n");
        xEventGroupSetBits(eth_event_group, ETHERNET_EVT_STARTED);

        //Notify task to start right away
        MSG("ME ih tnGive\n");
        xTaskNotifyGive(ethernetTaskHandle);
    }

    MSG("ME ih done\n");
    return mp_const_none;
}

STATIC mp_obj_t eth_ifconfig (mp_uint_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    STATIC const mp_arg_t wlan_ifconfig_args[] = {
        { MP_QSTR_config,           MP_ARG_OBJ,     {.u_obj = MP_OBJ_NULL} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(wlan_ifconfig_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(args), wlan_ifconfig_args, args);

    tcpip_adapter_dns_info_t dns_info;
    // get the configuration
    if (args[0].u_obj == MP_OBJ_NULL) {
        // get
        tcpip_adapter_ip_info_t ip_info;
        tcpip_adapter_get_dns_info(TCPIP_ADAPTER_IF_ETH, TCPIP_ADAPTER_DNS_MAIN, &dns_info);
        if (ESP_OK == tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_ETH, &ip_info)) {
            mp_obj_t ifconfig[4] = {
                netutils_format_ipv4_addr((uint8_t *)&ip_info.ip.addr, NETUTILS_BIG),
                netutils_format_ipv4_addr((uint8_t *)&ip_info.netmask.addr, NETUTILS_BIG),
                netutils_format_ipv4_addr((uint8_t *)&ip_info.gw.addr, NETUTILS_BIG),
                netutils_format_ipv4_addr((uint8_t *)&dns_info.ip, NETUTILS_BIG)
            };
            return mp_obj_new_tuple(4, ifconfig);
        } else {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
        }
    } else { // set the configuration
        if (MP_OBJ_IS_TYPE(args[0].u_obj, &mp_type_tuple)) {
            // set a static ip
            mp_obj_t *items;
            mp_obj_get_array_fixed_n(args[0].u_obj, 4, &items);

            tcpip_adapter_ip_info_t ip_info;
            netutils_parse_ipv4_addr(items[0], (uint8_t *)&ip_info.ip.addr, NETUTILS_BIG);
            netutils_parse_ipv4_addr(items[1], (uint8_t *)&ip_info.netmask.addr, NETUTILS_BIG);
            netutils_parse_ipv4_addr(items[2], (uint8_t *)&ip_info.gw.addr, NETUTILS_BIG);
            netutils_parse_ipv4_addr(items[3], (uint8_t *)&dns_info.ip, NETUTILS_BIG);

            tcpip_adapter_dhcpc_stop(TCPIP_ADAPTER_IF_ETH);
            tcpip_adapter_set_ip_info(TCPIP_ADAPTER_IF_ETH, &ip_info);
            tcpip_adapter_set_dns_info(TCPIP_ADAPTER_IF_ETH, TCPIP_ADAPTER_DNS_MAIN, &dns_info);

        } else {
            // check for the correct string
            const char *mode = mp_obj_str_get_str(args[0].u_obj);
            if (strcmp("dhcp", mode) && strcmp("auto", mode)) {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, mpexception_value_invalid_arguments));
            }

            if (ESP_OK != tcpip_adapter_dhcpc_start(TCPIP_ADAPTER_IF_ETH)) {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
            }
        }
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(eth_ifconfig_obj, 1, eth_ifconfig);

STATIC mp_obj_t eth_hostname (mp_uint_t n_args, const mp_obj_t *args) {
    eth_obj_t *self = args[0];
    if (n_args == 1) {
        return mp_obj_new_str((const char *)self->hostname, strlen((const char *)self->hostname));
    }
    else
    {
        const char *hostname = mp_obj_str_get_str(args[1]);
        if(hostname == NULL)
        {
            return mp_obj_new_bool(false);
        }
        eth_validate_hostname(hostname);
        tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_ETH, hostname);
        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(eth_hostname_obj, 1, 2, eth_hostname);

STATIC mp_obj_t modeth_mac (mp_obj_t self_in) {
    eth_obj_t *self = self_in;

    return mp_obj_new_bytes((const byte *)self->mac, sizeof(self->mac));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(modeth_mac_obj, modeth_mac);

STATIC mp_obj_t modeth_ksz8851_reg_wr (mp_uint_t n_args, const mp_obj_t *args) {

    if ((xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED)) {
        if(mp_obj_get_int(args[2]) == 0)
        {
            //modeth_sem_lock();
            return mp_obj_new_int(ksz8851_regrd(mp_obj_get_int(args[1])));
            //modeth_sem_unlock();
        }
        else
        {
            if (n_args > 3) {
                //modeth_sem_lock();
                ksz8851_regwr(mp_obj_get_int(args[1]), mp_obj_get_int(args[3]));
                //modeth_sem_unlock();
            }
            return mp_const_none;
        }
    }

    nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Ethernet module not initialized!"));
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(modeth_ksz8851_reg_wr_obj, 3, 4, modeth_ksz8851_reg_wr);

STATIC mp_obj_t modeth_deinit (mp_obj_t self_in) {

    system_event_t evt;

    if ((xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED)) {
        mod_network_deregister_nic(&eth_obj);
        evt.event_id = SYSTEM_EVENT_ETH_STOP;
        esp_event_send(&evt);

        ksz8851PowerDownMode();
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(modeth_deinit_obj, modeth_deinit);

STATIC mp_obj_t modeth_isconnected(mp_obj_t self_in) {
    if (xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_CONNECTED) {
        return mp_const_true;
    }
    return mp_const_false;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(modeth_isconnected_obj, modeth_isconnected);

STATIC const mp_map_elem_t eth_locals_dict_table[] = {
    { MP_OBJ_NEW_QSTR(MP_QSTR_init),                (mp_obj_t)&modeth_init_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_ifconfig),            (mp_obj_t)&eth_ifconfig_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_hostname),            (mp_obj_t)&eth_hostname_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_mac),                 (mp_obj_t)&modeth_mac_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_deinit),              (mp_obj_t)&modeth_deinit_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_isconnected),         (mp_obj_t)&modeth_isconnected_obj },
    { MP_OBJ_NEW_QSTR(MP_QSTR_register),            (mp_obj_t)&modeth_ksz8851_reg_wr_obj },

};
STATIC MP_DEFINE_CONST_DICT(eth_locals_dict, eth_locals_dict_table);

const mod_network_nic_type_t mod_network_nic_type_eth = {
    .base = {
        { &mp_type_type },
        .name = MP_QSTR_ETH,
        .make_new = eth_make_new,
        .locals_dict = (mp_obj_t)&eth_locals_dict,
    },

    .n_gethostbyname = lwipsocket_gethostbyname,
    .n_socket = lwipsocket_socket_socket,
    .n_close = lwipsocket_socket_close,
    .n_bind = lwipsocket_socket_bind,
    .n_listen = lwipsocket_socket_listen,
    .n_accept = lwipsocket_socket_accept,
    .n_connect = lwipsocket_socket_connect,
    .n_send = lwipsocket_socket_send,
    .n_recv = lwipsocket_socket_recv,
    .n_sendto = lwipsocket_socket_sendto,
    .n_recvfrom = lwipsocket_socket_recvfrom,
    .n_setsockopt = lwipsocket_socket_setsockopt,
    .n_settimeout = lwipsocket_socket_settimeout,
    .n_ioctl = lwipsocket_socket_ioctl,
    .n_setupssl = lwipsocket_socket_setup_ssl,
    .inf_up = is_eth_link_up,
    .set_default_inf = eth_set_default_inf
};
